================================================================================
Simple Symbol
================================================================================

def

--------------------------------------------------------------------------------

(source
  (sym_lit (sym_name)))

================================================================================
Symbol with Prefix
================================================================================

clojure.string/blank?

--------------------------------------------------------------------------------

(source
  (sym_lit
    (sym_ns)
    (sym_name)))

================================================================================
Division Symbol
================================================================================

/

--------------------------------------------------------------------------------

(source
  (sym_lit
    (sym_name)))

================================================================================
Namespaced Division Symbol
================================================================================

clojure.core//

--------------------------------------------------------------------------------

(source
  (sym_lit
    (sym_ns)
    (sym_name)))

================================================================================
Division Symbol followed by delimiter
================================================================================

(+ - * /)

--------------------------------------------------------------------------------

(source
  (list_lit
    (sym_lit (sym_name))
    (sym_lit (sym_name))
    (sym_lit (sym_name))
    (sym_lit (sym_name))))

================================================================================
Clojure CLR Generic List Type
================================================================================

|System.Collections.Generic.IList`1[System.Int32]|

--------------------------------------------------------------------------------

(source
  (sym_lit (sym_name))
  (syn_quoting_lit
    (num_lit))
  (vec_lit
    (sym_lit (sym_name)))
    (sym_lit (sym_name)))
